Revit 2026 API

# RelinquishOptionsUserWorksets Property

---

True means all user-created worksets owned by the current user should be relinquished. False means none of these are relinquished.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool UserWorksets { get; set; }
```
```vb
Public Property UserWorksets As Boolean
	Get
	Set
```
```cpp
public:
property bool UserWorksets {
	bool get ();
	void set (bool value);
}
```
```fsharp
member UserWorksets : bool with get, set
```

#### Property Value

Boolean

This defaults to false in the User Interface.

#### Reference

RelinquishOptions Class

Autodesk.Revit.DB Namespace